<?php

/**
 * 简单图片验证的配置项
 */

return [

    /** 验证码中的文字范围 */
    'font' => '0123456789abcdefghijklmnopqrstuvwxyz0123456789',

    /** 字体文件 */
    'fontFile' => 'BELL.TTF',

    /** 字符尺寸 单位为像素 */
    'fontSize' => '30',
    /** 验证码的字符数 */
    'codeCount' => '4',

    /** 验证图片宽度 单位为像素点 */
    'width' => '100',

    /**  */
    'height' => '30',

    /**
     * ======== 以下，数量值越少，图片越清晰 ============
     */

    /** 线的数量 */
    'lineCount' => '2',

    /** 点的数量  */
    'pixCount' => '200',

    /** 颜色数量 */
    'colorCount' => '2',

    /** 设置颜色 (RGB格式) */
    'colorStyle' => [
        ['0', '0', '0'],
    ],
];
